servicemix-osgi/cbr/result-SelectChannelConnector.txt
Christian-Muellers-MacBook-Pro:cbr cmueller$ /usr/sbin/httpd2.4/bin/ab -n 5000 -c 20 -p 1K_buyStocks.xml -T text/xml http://localhost:8192/service/CBRProxy
This is ApacheBench, Version 2.3 <$Revision: 1373084 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        Apache-Coyote/1.1
Server Hostname:        localhost
Server Port:            8192

Document Path:          /service/CBRProxy
Document Length:        1024 bytes

Concurrency Level:      20
Time taken for tests:   3.283 seconds
Complete requests:      5000
Failed requests:        0
Write errors:           0
Total transferred:      6385000 bytes
Total body sent:        5845000
HTML transferred:       5120000 bytes
Requests per second:    1522.89 [#/sec] (mean)
Time per request:       13.133 [ms] (mean)
Time per request:       0.657 [ms] (mean, across all concurrent requests)
Transfer rate:          1899.15 [Kbytes/sec] received
                        1738.54 kb/s sent
                        3637.69 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.1      1      19
Processing:     1   12   4.2     12      93
Waiting:        0   10   4.1     10      92
Total:          2   13   4.0     12      94

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     13
  75%     14
  80%     14
  90%     16
  95%     20
  98%     25
  99%     28
 100%     94 (longest request)